//////////////////////////////////////////////////////////////////////

alert('Привет'); alert('Мир');

//////////////////////////////////////////////////////////////////////

alert('Привет')
alert('Мир')

//////////////////////////////////////////////////////////////////////

function f() {
  // после объявления функции необязательно ставить точку с запятой
}

for(;;) {
  // после цикла точка с запятой также необязательна
}

//////////////////////////////////////////////////////////////////////

'use strict';

...

//////////////////////////////////////////////////////////////////////

let x = 5;
x = "Вася";

//////////////////////////////////////////////////////////////////////

typeof null == "object" // ошибка в языке
typeof function(){} == "function" // именно для функций

//////////////////////////////////////////////////////////////////////

let userName = prompt("Введите имя", "Алиса");
let isTeaWanted = confirm("Вы хотите чаю?");

alert( "Посетитель: " + userName ); // Алиса
alert( "Чай: " + isTeaWanted ); // true

//////////////////////////////////////////////////////////////////////

alert( '1' + 2 ); // '12', строка
alert( 1 + '2' ); // '12', строка

//////////////////////////////////////////////////////////////////////

alert( 0 == false ); // true
alert( 0 == '' ); // true

//////////////////////////////////////////////////////////////////////

// 1
while (condition) {
    ...
  }
  
  // 2
  do {
    ...
  } while (condition);
  
  // 3
  for(let i = 0; i < 10; i++) {
    ...
  }

//////////////////////////////////////////////////////////////////////
  
let age = prompt('Сколько вам лет?', 18);

switch (age) {
  case 18:
    alert("Так не сработает"); // результатом prompt является строка, а не число

  case "18":
    alert("А так сработает!");
    break;

  default:
    alert("Любое значение, неравное значению выше");
}

//////////////////////////////////////////////////////////////////////\

//Function Declaration: функция в основном потоке кода 
function sum(a, b) {
    let result = a + b;
  
    return result;
  }
//Function Expression: функция как часть выражения

let sum = function(a, b) {
    let result = a + b;
  
    return result;
  };

//Стрелочные функции:

// выражение в правой части
let sum = (a, b) => a + b;

// многострочный код в фигурных скобках { ... }, здесь нужен return:
let sum = (a, b) => {
  // ...
  return a + b;
}

// без аргументов
let sayHi = () => alert("Привет");

// с одним аргументом
let double = n => n * 2;

