let func = (arg1, arg2, ...argN) => expression;

//////////////////////////////////////////////////////////////////////

let func = function(arg1, arg2, ...argN) {
  return expression;
};

//////////////////////////////////////////////////////////////////////

let sum = (a, b) => a + b;

/* Более короткая форма для:

let sum = function(a, b) {
  return a + b;
};
*/

alert( sum(1, 2) ); // 3

//////////////////////////////////////////////////////////////////////

// тоже что и
// let double = function(n) { return n * 2 }
let double = n => n * 2;

alert( double(3) ); // 6

//////////////////////////////////////////////////////////////////////

let sayHi = () => alert("Hello!");

sayHi();

//////////////////////////////////////////////////////////////////////

let age = prompt("Сколько Вам лет?", 18);

let welcome = (age < 18) ?
  () => alert('Привет') :
  () => alert("Здравствуйте!");

welcome(); // теперь всё в порядке


//////////////////////////////////////////////////////////////////////


let sum = (a, b) => {  // фигурная скобка, открывающая тело многострочной функции
  let result = a + b;
  return result; // при фигурных скобках для возврата значения нужно явно вызвать return
};

alert( sum(1, 2) ); // 3
//////////////////////////////////////////////////////////////////////
function ask(question, yes, no) {
  if (confirm(question)) yes()
  else no();
}

ask(
  "Вы согласны?",
  function() { alert("Вы согласились."); },
  function() { alert("Вы отменили выполнение."); }
);
//////////////////////////////////////////////////////////////////////
ask(
    "Вы согласны?",
    () => alert("Вы согласились."),
    () => alert("Вы отменили выполнение.")
  );
//////////////////////////////////////////////////////////////////////
let ask = (question, yes, no) => confirm(question) ? yes() : no();


ask(
"Вы согласны?",
() => { alert("Вы согласились."); },
() => { alert("Вы отменили выполнение."); }
);